driver-tests/bpelse/assign/AssignJbi/test/CopydoubleInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <doublePart>
	<xsd_double>1.5E6</xsd_double>
        <optional_double>1.0E4</optional_double>
	<repeat_double>1.0E4</repeat_double>
	<repeat_double>2.5E8</repeat_double>
   </doublePart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
